#### `Metadata`
<details>
<summary>metadata.json</summary>

```json
{
  "PR_ID": "4",
  "SKIP_CICD": "0",
  "GIT_MASTER_COMMIT_ID": "7364754476af751c0064c62e34a278002979c9ec",
  "TF_WORKING_DIR": "examples",
  "CI_PWD": "/codebuild/output/src267446731/src/github.com/traveloka/Test-github-terraform"
}

```

</details>

#### `Terraform output`
<details>
<summary>terraform.tfplan</summary>

```hcl

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.this.module.random.random_id.this will be created
  + resource "random_id" "this" {
      + b64         = (known after apply)
      + b64_std     = (known after apply)
      + b64_url     = (known after apply)
      + byte_length = 8
      + dec         = (known after apply)
      + hex         = (known after apply)
      + id          = (known after apply)
      + prefix      = "LambdaRole_txtjobs-periodic-scheduler-"
    }

  # module.this.module.this.aws_iam_role.this will be created
  + resource "aws_iam_role" "this" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "lambda.amazonaws.com"
                        }
                      + Sid       = ""
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + description           = "Lambda Role for txtjobs-periodic-scheduler"
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = (known after apply)
      + name_prefix           = (known after apply)
      + path                  = "/lambda-role/"
      + tags                  = (known after apply)
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy {
          + name   = (known after apply)
          + policy = (known after apply)
        }
    }

Plan: 2 to add, 0 to change, 0 to destroy.

```

</details>